app/controllers/school_classes_controller.rb

    def show
        @school_class= SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @school_class= SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @school_class=SchoolClass.find params[:id]
        @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-07-02 07:37:32.075762"], ["id", 1]]